from langchain_core.prompts import ChatPromptTemplate
from prompts import json_structure, system_message
from langchain_openai import ChatOpenAI
from schemas import InvoiceJson
from dotenv import load_dotenv
from typing import Dict, List
import json
import os

load_dotenv()

def _get_llm(model_name: str) -> ChatOpenAI:
    llm = ChatOpenAI(model=model_name, temperature=0)
    return llm

input_json = [
    {
        "text": "💥Повторний вибух у Павлограді.",
        "date": "2024-09-06T07:18:07+00:00",
        "channel": "monitorwarr",
        "link": "https://t.me/monitorwarr/23895"
    },
    {
        "text": "💥Повторні вибухи у Павлограді.",
        "date": "2024-09-06T07:01:12+00:00",
        "channel": "monitorwarr",
        "link": "https://t.me/monitorwarr/23894"
    },
    {
        "text": "Далекобійність. Я радий, що тут, на «Рамштайні», представлені США, Велика Британія, Франція, Італія. Хочу сказати це відкрито, щоб не було жодних спекуляцій. Завдяки нашій спільній відвазі ми здійснили дуже важливі операції, зокрема в Криму. Ці операції дали нам змогу повернути безпеку в Чорне море й відновити наш експорт продовольства. \n\nЗараз ми чуємо, що ваша політика щодо далекобійності не змінилася, але ми бачимо зміни щодо ATACMS, Storm Shadow і SCALP – дефіцит ракет і співпраці. І це стосується навіть нашої території, окупованої Росією, включно з Кримом. Ми вважаємо такі кроки помилковими. Нам необхідна ця далекобійність не лише на окупованій території України, а й на території Росії, щоб у Росії був стимул прагнути до миру.",
        "date": "2024-09-06T09:47:15+00:00",
        "channel": "UkraineNow",
        "link": "https://t.me/UkraineNow/58471"
    },
    {
        "text": "**В ДСНС показали наслідки ворожого удару по Павлограді**\n\nЗа даними Дніпропетровської ОВА померла 1 людина. \n\nВже 40 постраждалих, - ДСНС.\n\n[✅підписуйся на Ukraine NOW](https://t.me/UkraineNow)",
        "date": "2024-09-06T09:41:24+00:00",
        "channel": "UkraineNow",
        "link": "https://t.me/UkraineNow/58466"
    },
    {
        "text": "**Україна під обстрілами - ситуація в регіонах за добу**\n\n**📍Дніпровщина**\nУ Павлограді внаслідок ранкового ворожого обстрілу вже 30 поранених. Троє з них – діти. Окрім 9-річної дівчинки, через ракетну атаку потерпіли хлопчики 11 та 4 років. Серед людей, які у лікарні, двоє важких. У Нікопольщині 2 поранених. Знеструмлені 7 населених пунктів району. Понівечені оселі, ЛЕП, газопроводи. На Криворіжжя ворог спрямував дрон-камікадзе. Через це в одному з населених пунктів пошкоджений приватний будинок. У Синельниківському районі знищено госпспоруду та потрощено до 10 приватних будинків.\n\n**📍Львівщина**\nворог атакував область бойовими безпілотниками. Через падіння уламків загорілися 4 вантажівки у промисловій зоні (машини ремонту не підлягають). Над ліквідацією займання працювали 32 пожежники, залучали 6 одиниць спецтехніки.  Понівечені складські приміщення.\n\n**📍Херсонщина**\nПісля 10.00 армія рф обстріляла Комишани. До лікарні ушпиталили 72-річну жінку. В Антонівці через російський терор ушпиталено 70-річного чоловіка. У лікарні помер 65-річний чоловік, який отримав поранення ще 21 серпня у Кіндійці. Зранку ворог бив з авіації по Херсонщині: 2 КАБи влучили в дитсадок, зруйнувавши його. Також понівечено Пункт Незламності, автобус та будинки. За добу росіяни поранили ще 4 людей, поціливши в освітній та медичні заклади, адмінбудівлю, ТРЦ, 2 багатоповерхівки, 8 приватних будинків, складське приміщення та автівки. \n\n**📍Сумщина**\nросійська армія нанесла 160 ударів по 46 населених пунктах: пошкоджено 3 багатоповерхівки, 25 будинків, лікарню, ліцей, підприємства, госпспоруду, 2 гаражі, 3 автівки, 2 вантажівки та 2 причепи. \n\n**📍Донеччина**\nросіяни вбили 2 людей. Ще 12 цивільних поранили. Понівечили понад 120 приватних будинків, 15 багатоповерхівок, 2 обʼєкти інфраструктури, 4 ЛЕП та підприємства.\n\n**📍Київщина**\nВнаслідок падіння уламків рашистських дронів в 2 районах на відкритих ділянках місцевості сталися 2 пожежі трав'яного настилу та пожежа лісової підстилки.\n\n**📍Харківщина**\nСьогодні близько 8:50 ворог здійснив обстріл села Вільшани: поранено працівника місцевого підприємства, пошкоджено вантажівку, зайнялася пожежа в екосистемі на відкритій території. За добу в області через зс рф постраждали ще 2 особи. Горіли трава, лісові підстилки, 5 госпспоруд, 2 будинки, 4 приватних домоволодінь. Пошкоджені лінії електропередач.\n\n**📍Запоріжжя**\nВпродовж доби окупанти 330 разів били по 11 населених пунктах. Надійшло 21 повідомлення про руйнування житлових будинків та об'єктів інфраструктури. \n\n**📍Миколаївщина**\nНад областю знищили 7 БПЛА ворога. Внаслідок падіння уламків у Баштанському районі на відкритій території відбулося займання сухої трави, яке було оперативно ліквідовано. Вчора окупанти пошкодили будинок у с. Дмитрівка, обстрілявши Куцурубську громаду з артилерії.\n\n[✅підписуйся на Ukraine NOW](https://t.me/UkraineNow)",
        "date": "2024-09-06T09:36:20+00:00",
        "channel": "UkraineNow",
        "link": "https://t.me/UkraineNow/58465"
    }
]


def collect_info(input_json: List[dict]) -> List[dict]:
    llm = _get_llm("gpt-4o-mini")    
    for entry in input_json:
        text = entry["text"]

        try:

            structured_llm = llm.with_structured_output(InvoiceJson)
            system_prompt = system_message.format(json_structure=json_structure)
            prompt = ChatPromptTemplate.from_messages(
                [("system", system_prompt), ("human", "{input}")]
            )
            few_shot_structured_llm = prompt | structured_llm
            
            input_prompt = f"raw_text: {text}"
            data = few_shot_structured_llm.invoke({"input": input_prompt})
            result = [dict(region) for region in data.info]
            entry['emergency_info'] = result
        except Exception as e:
            print(e)
    
        
    return input_json
    

jsonr = collect_info(input_json=input_json)
for i in jsonr:
    print("_"*20)
    print(i)
    print("_"*20)
