from llm import get_updated_data

new_info = """
З самого ранку Херсон здригався від вибухів: рятувальники працювали під загрозою повтору ворожих атак
У передмісті окупанти влучили в дах житлового будинку. Водночас в іншому районі міста ворожий БПЛА скинув вибухівку на легковий автомобіль, що стояв на приватному подвір’ї.
Роботі вогнеборців постійно перешкоджали ворожі БПЛА. Окупанти намагалися скинути вибухівку на рятувальників. На щастя підрозділ встиг від’їхати до безпечного місця.
Пожежі ліквідовано.
За забезпечення безпеки рятувальників від ворожих БпЛА завдячуємо нашим партнерам Схід-СОС.
"""
res = get_updated_data(new_info)

print(res)